-- ============================================================
-- Домашнее задание к лекции «SQL. Введение»
-- Школа Аналитиков · учебная база hh_school
-- Автор: Киселева Анна Максимовна
-- ============================================================
-- Формат: задания по порядку, каждое начинается с комментария
-- с номером; под каждым запросом — вывод (2–3 предложения).
-- Запрос без вывода не засчитывается.
-- ============================================================

SET search_path TO hh_school;


-- ============================================================
-- БЛОК А. Разминка: термины и структура (текстом)
-- ============================================================

-- ЗАДАНИЕ А1
-- 1. Категория и конкретный тип колонок:
--    vacancies.salary_from        — категория: числовые   тип: INTEGER
--    vacancies.vacancy_name       — категория: строковые   тип: TEXT
--    vacancies.published_at       — категория: дата и время   тип: TIMESTAMP
--    employers.is_accredited_it   — категория: логические   тип: BOOLEAN
--    responses.created_at         — категория: дата и время   тип: TIMESTAMP
--
-- 2. Первичные ключи таблиц:
--    areas: area_id
--    employers: employer_id
--    vacancies: vacancy_id
--    vacancy_details: vacancy_id (чем особенный: тем, что он является первичным и вторичным ключом одновременно)
--    responses: response_id
--
-- 3. Почему vacancy_name не может быть первичным ключом:
--    Так как в этой колонке есть не уникальные значения, а первичным ключом может быть группа только уникальных значений, которые не повторяются 
--    Запрос для подтверждения числом: Самое частое название (а именно Я"Стажёр: аналитик данных" встречается в базе 6 раз.
-- запрос:
select vacancy_name, count(*) as count
from vacancies
group by vacancy_name
order by count desc
limit 5

-- Вывод:
--Самое частое название вакансии встречается в базе 6 раз. 
--Это говорит о том, что значение не является уникальным, а первичный ключ по определению должен быть уникальным для каждой строки.
-- 4. Что произойдёт при записи строки «по договорённости» в salary_from:
--    Если в строку salary_from с числовым типом данных сделать запись строковую, то СУБД выдаст ошибку из-за несовподения типов данных.
-- В этом плане типы данных отвечают за целостность. Если бы в эту строку можно было бы вписывать что угодно, тогда аналитик не смог бы посчитать, например, среднюю зарплату.

-- ============================================================
-- БЛОК Б. Первые запросы: SELECT, WHERE, ORDER BY
-- ============================================================

-- ЗАДАНИЕ Б1
-- Запрос: experience
select distinct experience
from vacancies
order by experience

-- Запрос: employment
select distinct employment
from vacancies
order by employment

-- Запрос: professional_role
select distinct professional_role
from vacancies
order by professional_role
-- Вывод:
-- В колонке experience обнаружено 3 уникальных значения, в employment — 3 значения, в professional_role — 5 значений. 
-- Пропусков (NULL) и признаков проблем с качеством данных (опечаток или разных вариантов написания одного и того же) не выявлено.

-- ЗАДАНИЕ Б2
-- Запрос 1: стажировки в Москве без опыта, вакансия открыта
select vacancy_id as ID_вакансии, vacancy_name as Вакансия, 
salary_from as Нижн_граница_зп, published_at as Дата_публикации
from vacancies
where area_id = '1' and experience = 'Нет опыта' and employment = 'Стажировка' and closed_at is null  
order by published_at desc 

-- Запрос 2: топ-10 вакансий по salary_from
select vacancy_name, professional_role , salary_from
from vacancies
order by salary_from desc nulls last
limit 10

-- Вывод:
--1. По результатам 1 запроса было выявлено 8 вакансий (причем в одной из них отсутсвует значение о нижней границе зарплаты ID 1020).
--Если убрать условие про Москву, то под запрос попадут уже 10 вакансий (причем 8 из них по-прежнему из Москвы)

--2. Во втором запросе наибольшая нижняя граница у senior разработчика, однако важно при выводах учитывать, что это одна из крайних границ зарплатной вилки,
-- т.е. на других позициях "среднее" значение может быть выше.


-- ЗАДАНИЕ Б3
-- Ловушка 1. NULL — выполнить и объяснить результат
SELECT count(*) FROM vacancies WHERE closed_at = NULL;
SELECT count(*) FROM vacancies WHERE closed_at IS NULL;

-- Ловушка 2. AND / OR — выполнить и объяснить результат
SELECT count(*) FROM vacancies
WHERE area_id = 1 OR area_id = 2 AND experience = 'Нет опыта';

SELECT count(*) FROM vacancies
WHERE (area_id = 1 OR area_id = 2) AND experience = 'Нет опыта';

-- Вывод:
--1. В 1-ом запросе (1ого условия)  NULL выдал конкретное число, а именно 0, так как любое сравнение с NULL дает NULL, а в WHERE условие должно быть истинным, 
-- если выражение возварщает NULL, система трактует это как ложь (FALSE/0).
--2 строчка написана верно и мы ищем кол-во вакансий, где строка closed_at действительно пустая 
--Это опаснее ошибки, так как числовое значение участвует в анализе данных (0 не говорит о неизвестном, оно говорит о самом низком значении) 
-- и сильно может их исказить, тогда как пустое значение (неизвестность) можно убрать на этапе сортировки данных. 
--В колонке closed_at значение NULL означает, что даты закрытия вакансии не сущетсвует, т.е.вакансия еще открыта.

--2. Во 2 запросе 1ое условие означало для базы: посчитай мне все вакансии из Москвы (любой опыт), а также прибавь вакансии из Санкт-петербурга, в которых не требуется опыт
--На вопрос «вакансии из Москвы или Санкт-Петербурга, но обязательно без опыта» отвечает 2ой запрос.

-- ============================================================
-- БЛОК В. Агрегации и метрики
-- ============================================================

-- ЗАДАНИЕ В1
-- Запрос 1: счётчики (строки, зарплата указана, направления, работодатели)
select count(*) as число_строк, count(salary_from) as с_нижн_зарплатой,  
count(distinct professional_role) as число_направлений, count(distinct employer_id) as число_работодателей
from vacancies

-- Запрос 2: доля активных вакансий (без JOIN)
select count(*) - count(closed_at) as откр_вакансии,
count(closed_at) as закр_вакансии, round(((count(*) - count(closed_at))*100.0/count(*)),1) as проц_открытых
from vacancies

-- Вывод:
--1. count(*) - считает все строки, котраые содержат хоть какие-то данные, логично, что это число саммое большое - 52, 
---count(salary_from) - посчитал число строк, с нижней зарплатой, это число меньше - 44, что говорит о том, что не все строчки содержат значение salary_from
--- и count(DISTINCT колонка) по работодателям и по направлениям говорит о том, что число уникальных работодателей - 12, а уникальных направлений - 5

--2. У нас было 52 вакансии: из них сейчас открыто 33 вакансии, что составляет 63,5% от общего числа вакансий.


-- ЗАДАНИЕ В2
-- Запрос 1: направления — вакансии, работодатели, средняя зарплата
select professional_role as направления, count(vacancy_id) as число_вакансий , count(distinct employer_id) as работодатели, round(avg(salary_from)) as ср_нижн_зп
from vacancies
group by professional_role 
order by число_вакансий DESC

-- Запрос 2: то же, только направления с ≥ 5 открытыми вакансиями (WHERE + HAVING)
select professional_role as направления, count(*)-count(closed_at) as откр_вакансии, count(vacancy_id) as число_вакансий , count(distinct employer_id) as работодатели, round(avg(salary_from)) as ср_нижн_зп
from vacancies
where closed_at is null 
group by professional_role 
having count(*) >= 5
order by число_вакансий DESC


-- Вывод:
--1. Соискатель сделал бы вывод, что больше половины рынка занимают направления: аналитик данных и разработчик (самое большое число вакантных мест, больше работодателей и нижняя граница вилки в среднем выше)
--Однако, это не говорит однозначно о том, что эти вакансии самые привлекательные, как минимум, нам не хватает второй границы зарпл.вилки,
---чтобы конкретнее говорить о зарплатных преимуществах этих позиций.
--А еще число вакансий в данном случае учитывает и закрытые и открытые позиции, т.е. для конкретного вывода по рынку нужно значть кол-во именно открытых вакансий.
--2. WHERE фильтрует вакансии до группировки (по открытым вакансиям), а HAVING уже фильтрует сформированные группы, выбирает те, в которых не менне 5 откр.вакансий.
--Если попытаться написать WHERE count(*) >= 5, субд выдаст ошибку, т.к. агрегатные функции нельзя применять в WHERE. 
--С точки зрения логики исполнения запроса, таким действием мы хотим отфильтровать кол-во строк, в несуществующих группах, 
---что просто невозможно
--3. avg(salary_from) говорит о среднем значении нижней границы зп на направлении, т.е на самих вакансиях могут быть и высокие низкие границы, 
---это значение лишь их арифм.среднее. Такая функция не отвечает на вопрос предлагаемой зарплаты по этому напрвлению, минимум не хватает полной зарплатной вилки, 
---чтобы приблизиться к выводам, отражающим реальность рынка труда.


-- ============================================================
-- БЛОК Г. Соединение таблиц
-- ============================================================

-- ЗАДАНИЕ Г1
-- Запрос: топ-5 по salary_from с названием компании и городом (псевдонимы таблиц)
select v.vacancy_name as вакансия, v.salary_from as нижн_зарпл, e.employer_name as компания, a.area_name as город
from vacancies v 
inner join areas a 
	on a.area_id = v.area_id 
inner join employers e 
	on e.employer_id = v.employer_id 
order by нижн_зарпл desc nulls last
limit 5

-- Вывод:
--Если убрать псевдонимы и написать, например, вместо a.area_id или v.area_id просто area_id, то система выдаст ошибку, 
--- так как не сможет понят откуда взять эту колонку (она есть сразу в 3 таблицах: vacancies, employers и areas)


-- ЗАДАНИЕ Г2
-- Запрос 1: все работодатели, число вакансий и откликов (LEFT JOIN)
select e.employer_name as работодатель, count(distinct v.vacancy_id) as число_вакансий, 
	count(r.response_id) as число_откликов
from employers e 
left join vacancies v
	on e.employer_id = v.employer_id
left join responses r 
	on v.vacancy_id = r.vacancy_id
group by e.employer_name
order by число_вакансий desc

-- Запрос 2: тот же запрос с INNER JOIN
select e.employer_name as работодатель, count(distinct v.vacancy_id) as число_вакансий, 
	count(r.response_id) as число_откликов
from employers e 
inner join vacancies v
	on e.employer_id = v.employer_id
inner join responses r 
	on v.vacancy_id = r.vacancy_id
group by e.employer_name
order by число_вакансий desc

-- Вывод:
--1. Мы используем distinct для вакансий, потому что на одну вакансию может быть несколько отликов, которые без distinct в финальной таблице
---покажут одну и ту же вакансию несколько раз, а в нашем случае посчитают ее несколько раз 
---(итого у нас будет не 9 вакансий, а 157)
--2. Во 2 запросе пропала компания ГринЭнерго, у нее было 0 откликов, именно поэтому соединение inner join проигнорировало эту колонку.
---А для запроса критически важно, чтобы были в том числе компании, у которых откликов ноль.
--3. Я выбираю inner, когда мне нужно найти пересечения без учета не полностью заполненных строк
--Я выберу left, если мне нужно присоединить совпадения к основной таблице все (даже пустые) строки из других таблиц
--В данном случае, нам было критически важно знать в каких компаниях нет откликов или нет вакансий, 
---поэтому нужны все строчки, которые совпали с главной таблицей - это делает left join


-- ============================================================
-- БЛОК Д. Функции и финальный кейс
-- ============================================================

-- ЗАДАНИЕ Д1
-- Запрос: помесячная динамика откликов и конверсия
-- (месяц как дата, условный агрегат, nullif в знаменателе)
select date_trunc('month', created_at)::date as месяц,
	count(response_id) as число_откликов,
	count(response_id) FILTER (WHERE status = 'invited') as число_приглашений,
	round (100.0 * count(response_id) FILTER (WHERE status = 'invited') / nullif (count(response_id),0),1) as конверсия_отклика
from responses
group by 1
order by 1;


-- Вывод:
--1. Максимальная конверсия откликов в июне - 19,5%
--2. Да, этому месяцу можно доверять, потому что в нем наибольший объем данных — 118 откликов (и 23 приглашения). 
--Чем больше выборка, тем меньше влияние случайности и тем точнее процент конверсии.
--3. Последний месяц - август (2026-08-01). 
--У него очень маленький объем откликов (41 отклик) по сравнению с средним значением по другим месяцам.
--Судя по базе данных - последний отклик зафиксирован 2026-08-15 08:00:00, т.е. в середине месяца (он еще не закончился), 
---это говорит о том, что конверсия 7,3% здесь статистически недостоверна. Поэтому этот месяц лучше исключить, чтобы не искажать общую динамику по месяцам.

-- ЗАДАНИЕ Д2
-- Запрос: таблица по направлениям (вакансии, отклики, приглашения,
-- откликов на вакансию, конверсия)
select v.professional_role, 
	count(distinct v.vacancy_id) as число_вакансий, 
	count(r.response_id) as число_откликов, 
	count (r.response_id) filter (where status = 'invited') as число_приглашений,
	round(1.0* count(r.response_id)/nullif(count(distinct v.vacancy_id),0),1),
	round (100.0*count (r.response_id) filter (where status = 'invited')/nullif(count(r.response_id),0),1) as конверсия_откликов
from vacancies v
left join responses r
	on v.vacancy_id = r.vacancy_id
group by v.professional_role

-- Письменные ответы:
-- 1. Совпадает ли направление с наибольшим числом вакансий с направлением
--    с наибольшей конверсией?
--Нет, не совпадает, лидер по кол-ву вакансий  "Аналитик данных" (16) 
---не является лидером по конверсии ("Тестировщик 35,9%")

-- 2. Какое направление выбрать и почему (опираясь на два столбца):
--Я бы выбрала направление "Тестировщик" так как среднее число откликов на вакансию самое маленькое, 
---а конверсия отклика занимает лидирующие позиции
--Таким образом, если мне нужно будет быстрее получить отклик, вероятнее это быстрее случится на направлении "Тестировщик""

-- 3. Оговорка к выводу:
--Эти данные не говорят о конверсии отклика в трудоустройство (оффер), на небольшое кол-во вакансий действительно может быть много приглашений,
---однако не ясно, гарантирует, что все эти вакансии будут закрыты.
--Кроме того, мы не учитываем уровень зарплат в этих направлениях.


-- ============================================================
-- БЛОК Е. Со звёздочкой
-- ============================================================

-- ЗАДАНИЕ Е1
-- Исходный запрос (выполнить и посмотреть результат):
-- SELECT v.professional_role,
-- count(*) AS vacancies,
-- sum(v.salary_from) AS total_salary,
-- count(r.response_id) / count(*) AS responses_per_vacancy
-- FROM vacancies v
-- JOIN responses r ON v.vacancy_id = r.vacancy_id
-- WHERE v.closed_at = NULL
-- GROUP BY 1;
--
-- Ошибки (минимум четыре):
-- 1. closed_at is null - любая арифметика с null дает null
-- 2. Так как count(*) пропускает null, значит в responses_per_vacancy в знаменателе может пояивться 0 или null, нужно nullif
-- 3. distinct - без него считаются много строчек с одной и той же вакансией 
-- 4. простое деление даст нам целое число, которое может исказить реальное значение и интерпретацию, 
---поэтому нужно исползовать round и добавить decimal в виде 1.0
-- 5. Для защиты от размножения строк при подсчете суммы зарплат я использовала SUM(DISTINCT v.salary_from). 
---Но, если в базе данных несколько вакансий с одинаковой зарплатой, distinct их отсортирует, что исказит, например, общий вывод о бюджете.

-- Исправленный запрос:
SELECT v.professional_role,
count(distinct v.vacancy_id) AS vacancies,
sum(v.salary_from) AS total_salary,
round(1.0* count(r.response_id) / nullif (count(distinct v.vacancy_id),0),1) AS responses_per_vacancy
FROM vacancies v
JOIN responses r ON v.vacancy_id = r.vacancy_id
WHERE v.closed_at is NULL
GROUP BY 1;

-- Какие два правила из лекции защитили бы от этих ошибок при написании запроса:
-- 1. Правило работы с NULL: сравнение с NULL никогда не истина (здесь нужно, например, is null).
--А для защиты знаменателя от нуля нужно использовать NULLIF

-- 2. Помнить о порядке работы с объединенными таблицами: сначала выполняется объединение JOIN, а затем группировка group by 
---(если связь "один ко многим", строки в итоговой таблице размножаются).
--Для подсчета уникальных значений (вакансий) нужно использовать COUNT(DISTINCT),
--Соответственно для суммирования нужно быть осторожным с sum, чтобы не сложить одну и ту же зарплату несколько раз.
